---
kind: method
id: M:Autodesk.Revit.DB.PlanCircuitSet.Contains(Autodesk.Revit.DB.PlanCircuit)
source: html/86aad3a2-7e1e-eecc-731e-1b31468698c0.htm
---
# Autodesk.Revit.DB.PlanCircuitSet.Contains Method

Tests for the existence of an item within the set.

## Syntax (C#)
```csharp
public virtual bool Contains(
	PlanCircuit item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.PlanCircuit`) - The item to be searched for.

## Returns
The Contains method returns True if the item is within the set, otherwise False.